sployal/surveilance_security/Esp32video_stream/app_httpd.cpp
  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  size_t fb_len = 0;
#endif
  if (fb->format == PIXFORMAT_JPEG) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = fb->len;
#endif
    res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
  } else {
    jpg_chunking_t jchunk = {req, 0};
    res = frame2jpg_cb(fb, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
    httpd_resp_send_chunk(req, NULL, 0);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = jchunk.len;
#endif
  }
  esp_camera_fb_return(fb);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_end = esp_timer_get_time();
#endif
  log_i("JPG: %uB %ums", (uint32_t)(fb_len),
        (uint32_t)((fr_end - fr_start) / 1000));
  return res;
}

// ══════════════════════════════════════════════════════════════════════════════
//  Stream handler  (MJPEG)
// ══════════════════════════════════════════════════════════════════════════════
static esp_err_t stream_handler(httpd_req_t *req) {
  camera_fb_t    *fb          = NULL;
  struct timeval  _timestamp;
  esp_err_t       res         = ESP_OK;
  size_t          _jpg_buf_len = 0;
  uint8_t        *_jpg_buf    = NULL;
  char           *part_buf[128];

  static int64_t last_frame = 0;
  if (!last_frame) last_frame = esp_timer_get_time();

  res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
  if (res != ESP_OK) return res;

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "X-Framerate", "60");

#if defined(LED_GPIO_NUM)
  isStreaming = true;
  enable_led(true);
#endif

  while (true) {
    fb = esp_camera_fb_get();
    if (!fb) {
      log_e("Camera capture failed");
      res = ESP_FAIL;
    } else {
      _timestamp.tv_sec  = fb->timestamp.tv_sec;
      _timestamp.tv_usec = fb->timestamp.tv_usec;
      if (fb->format != PIXFORMAT_JPEG) {
        bool jpeg_converted = frame2jpg(fb, 80, &_jpg_buf, &_jpg_buf_len);
        esp_camera_fb_return(fb);
        fb = NULL;
        if (!jpeg_converted) {
          log_e("JPEG compression failed");
          res = ESP_FAIL;
        }
      } else {
        _jpg_buf_len = fb->len;
        _jpg_buf     = fb->buf;
      }
    }

    if (res == ESP_OK)
      res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY,
                                  strlen(_STREAM_BOUNDARY));
    if (res == ESP_OK) {
      size_t hlen = snprintf((char *)part_buf, 128, _STREAM_PART,
                             _jpg_buf_len,
                             _timestamp.tv_sec, _timestamp.tv_usec);
      res = httpd_resp_send_chunk(req, (const char *)part_buf, hlen);
    }
    if (res == ESP_OK)
      res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);

    if (fb) {
      esp_camera_fb_return(fb);
      fb       = NULL;
      _jpg_buf = NULL;
    } else if (_jpg_buf) {
      free(_jpg_buf);
      _jpg_buf = NULL;
    }

    if (res != ESP_OK) {
      log_e("Send frame failed");
      break;
    }

    int64_t fr_end    = esp_timer_get_time();
    int64_t frame_time = fr_end - last_frame;
    last_frame         = fr_end;
    frame_time        /= 1000;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    uint32_t avg_frame_time = ra_filter_run(&ra_filter, frame_time);
#endif
    log_i("MJPG: %uB %ums (%.1ffps), AVG: %ums (%.1ffps)",
          (uint32_t)(_jpg_buf_len),
          (uint32_t)frame_time,  1000.0 / (uint32_t)frame_time,
          avg_frame_time,        1000.0 / avg_frame_time);
  }

#if defined(LED_GPIO_NUM)
  isStreaming = false;
  enable_led(false);
#endif
  return res;
}

// ══════════════════════════════════════════════════════════════════════════════
//  Query-string helpers
// ══════════════════════════════════════════════════════════════════════════════
static esp_err_t parse_get(httpd_req_t *req, char **obuf) {
  char  *buf     = NULL;
  size_t buf_len = httpd_req_get_url_query_len(req) + 1;
  if (buf_len > 1) {
    buf = (char *)malloc(buf_len);
    if (!buf) { httpd_resp_send_500(req); return ESP_FAIL; }
    if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
      *obuf = buf;
      return ESP_OK;
    }
    free(buf);
  }
  httpd_resp_send_404(req);
  return ESP_FAIL;
}

static int parse_get_var(char *buf, const char *key, int def) {
  char _int[16];
  if (httpd_query_key_value(buf, key, _int, sizeof(_int)) != ESP_OK)
    return def;
  return atoi(_int);
}

// ══════════════════════════════════════════════════════════════════════════════
//  Camera control command handler  (/control?var=xxx&val=yyy)
// ══════════════════════════════════════════════════════════════════════════════
static esp_err_t cmd_handler(httpd_req_t *req) {
  char *buf = NULL;
  char  variable[32];
  char  value[32];

  if (parse_get(req, &buf) != ESP_OK) return ESP_FAIL;
  if (httpd_query_key_value(buf, "var", variable, sizeof(variable)) != ESP_OK
   || httpd_query_key_value(buf, "val", value,    sizeof(value))    != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  int      val = atoi(value);
  log_i("%s = %d", variable, val);
  sensor_t *s  = esp_camera_sensor_get();
  int       res = 0;

  if      (!strcmp(variable, "framesize"))     { if (s->pixformat == PIXFORMAT_JPEG) res = s->set_framesize(s, (framesize_t)val); }
  else if (!strcmp(variable, "quality"))       res = s->set_quality(s, val);
  else if (!strcmp(variable, "contrast"))      res = s->set_contrast(s, val);
  else if (!strcmp(variable, "brightness"))    res = s->set_brightness(s, val);
  else if (!strcmp(variable, "saturation"))    res = s->set_saturation(s, val);
  else if (!strcmp(variable, "gainceiling"))   res = s->set_gainceiling(s, (gainceiling_t)val);
  else if (!strcmp(variable, "colorbar"))      res = s->set_colorbar(s, val);
  else if (!strcmp(variable, "awb"))           res = s->set_whitebal(s, val);
  else if (!strcmp(variable, "agc"))           res = s->set_gain_ctrl(s, val);
  else if (!strcmp(variable, "aec"))           res = s->set_exposure_ctrl(s, val);
  else if (!strcmp(variable, "hmirror"))       res = s->set_hmirror(s, val);
  else if (!strcmp(variable, "vflip"))         res = s->set_vflip(s, val);
  else if (!strcmp(variable, "awb_gain"))      res = s->set_awb_gain(s, val);
  else if (!strcmp(variable, "agc_gain"))      res = s->set_agc_gain(s, val);
  else if (!strcmp(variable, "aec_value"))     res = s->set_aec_value(s, val);
  else if (!strcmp(variable, "aec2"))          res = s->set_aec2(s, val);
  else if (!strcmp(variable, "dcw"))           res = s->set_dcw(s, val);
  else if (!strcmp(variable, "bpc"))           res = s->set_bpc(s, val);
  else if (!strcmp(variable, "wpc"))           res = s->set_wpc(s, val);
  else if (!strcmp(variable, "raw_gma"))       res = s->set_raw_gma(s, val);
  else if (!strcmp(variable, "lenc"))          res = s->set_lenc(s, val);
  else if (!strcmp(variable, "special_effect"))res = s->set_special_effect(s, val);
  else if (!strcmp(variable, "wb_mode"))       res = s->set_wb_mode(s, val);
  else if (!strcmp(variable, "ae_level"))      res = s->set_ae_level(s, val);
#if defined(LED_GPIO_NUM)
  else if (!strcmp(variable, "led_intensity")) {
    led_duty = val;
    if (isStreaming) enable_led(true);
  }
#endif
  else {
    log_i("Unknown command: %s", variable);
    res = -1;
  }

  if (res < 0) return httpd_resp_send_500(req);
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

// ══════════════════════════════════════════════════════════════════════════════
//  Status handler  (/status)
// ══════════════════════════════════════════════════════════════════════════════
static int print_reg(char *p, sensor_t *s, uint16_t reg, uint32_t mask) {
  return sprintf(p, "\"0x%x\":%u,", reg, s->get_reg(s, reg, mask));
}

static esp_err_t status_handler(httpd_req_t *req) {
  static char json_response[1024];
  sensor_t   *s = esp_camera_sensor_get();
  char       *p = json_response;
  *p++ = '{';

  if (s->id.PID == OV5640_PID || s->id.PID == OV3660_PID) {
    for (int reg = 0x3400; reg < 0x3406; reg += 2)
      p += print_reg(p, s, reg, 0xFFF);
    p += print_reg(p, s, 0x3406, 0xFF);
    p += print_reg(p, s, 0x3500, 0xFFFF0);
    p += print_reg(p, s, 0x3503, 0xFF);
    p += print_reg(p, s, 0x350a, 0x3FF);
    p += print_reg(p, s, 0x350c, 0xFFFF);
    for (int reg = 0x5480; reg <= 0x5490; reg++) p += print_reg(p, s, reg, 0xFF);
    for (int reg = 0x5380; reg <= 0x538b; reg++) p += print_reg(p, s, reg, 0xFF);
    for (int reg = 0x5580; reg <  0x558a; reg++) p += print_reg(p, s, reg, 0xFF);
    p += print_reg(p, s, 0x558a, 0x1FF);
  } else if (s->id.PID == OV2640_PID) {
    p += print_reg(p, s, 0xd3,  0xFF);
    p += print_reg(p, s, 0x111, 0xFF);
    p += print_reg(p, s, 0x132, 0xFF);
  }

  p += sprintf(p, "\"xclk\":%u,",          s->xclk_freq_hz / 1000000);
  p += sprintf(p, "\"pixformat\":%u,",      s->pixformat);
  p += sprintf(p, "\"framesize\":%u,",      s->status.framesize);
  p += sprintf(p, "\"quality\":%u,",        s->status.quality);
  p += sprintf(p, "\"brightness\":%d,",     s->status.brightness);
  p += sprintf(p, "\"contrast\":%d,",       s->status.contrast);
  p += sprintf(p, "\"saturation\":%d,",     s->status.saturation);
  p += sprintf(p, "\"sharpness\":%d,",      s->status.sharpness);
  p += sprintf(p, "\"special_effect\":%u,", s->status.special_effect);
  p += sprintf(p, "\"wb_mode\":%u,",        s->status.wb_mode);
  p += sprintf(p, "\"awb\":%u,",            s->status.awb);
  p += sprintf(p, "\"awb_gain\":%u,",       s->status.awb_gain);
  p += sprintf(p, "\"aec\":%u,",            s->status.aec);
  p += sprintf(p, "\"aec2\":%u,",           s->status.aec2);
  p += sprintf(p, "\"ae_level\":%d,",       s->status.ae_level);
  p += sprintf(p, "\"aec_value\":%u,",      s->status.aec_value);
  p += sprintf(p, "\"agc\":%u,",            s->status.agc);
  p += sprintf(p, "\"agc_gain\":%u,",       s->status.agc_gain);
  p += sprintf(p, "\"gainceiling\":%u,",    s->status.gainceiling);
  p += sprintf(p, "\"bpc\":%u,",            s->status.bpc);
  p += sprintf(p, "\"wpc\":%u,",            s->status.wpc);
  p += sprintf(p, "\"raw_gma\":%u,",        s->status.raw_gma);
  p += sprintf(p, "\"lenc\":%u,",           s->status.lenc);
  p += sprintf(p, "\"hmirror\":%u,",        s->status.hmirror);
  p += sprintf(p, "\"vflip\":%u,",          s->status.vflip);
  p += sprintf(p, "\"dcw\":%u,",            s->status.dcw);
  p += sprintf(p, "\"colorbar\":%u",        s->status.colorbar);
#if defined(LED_GPIO_NUM)
  p += sprintf(p, ",\"led_intensity\":%u",  led_duty);
#else
  p += sprintf(p, ",\"led_intensity\":%d",  -1);
#endif
  *p++ = '}';
  *p++ = 0;

  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, json_response, strlen(json_response));
}

// ══════════════════════════════════════════════════════════════════════════════
//  XCLK handler  (/xclk?xclk=<MHz>)
// ══════════════════════════════════════════════════════════════════════════════
static esp_err_t xclk_handler(httpd_req_t *req) {
  char *buf = NULL;
  char  _xclk[32];

  if (parse_get(req, &buf) != ESP_OK) return ESP_FAIL;
  if (httpd_query_key_value(buf, "xclk", _xclk, sizeof(_xclk)) != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  int xclk = atoi(_xclk);
  log_i("Set XCLK: %d MHz", xclk);
  sensor_t *s   = esp_camera_sensor_get();
  int       res = s->set_xclk(s, LEDC_TIMER_0, xclk);
  if (res) return httpd_resp_send_500(req);

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

// ══════════════════════════════════════════════════════════════════════════════
//  Register write handler  (/reg?reg=<r>&mask=<m>&val=<v>)
// ══════════════════════════════════════════════════════════════════════════════
static esp_err_t reg_handler(httpd_req_t *req) {
  char *buf = NULL;
  char  _reg[32], _mask[32], _val[32];

  if (parse_get(req, &buf) != ESP_OK) return ESP_FAIL;
  if (httpd_query_key_value(buf, "reg",  _reg,  sizeof(_reg))  != ESP_OK
   || httpd_query_key_value(buf, "mask", _mask, sizeof(_mask)) != ESP_OK
   || httpd_query_key_value(buf, "val",  _val,  sizeof(_val))  != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  int reg = atoi(_reg), mask = atoi(_mask), val = atoi(_val);
  log_i("Set Register: reg: 0x%02x, mask: 0x%02x, value: 0x%02x",
        reg, mask, val);
  sensor_t *s   = esp_camera_sensor_get();
  int       res = s->set_reg(s, reg, mask, val);
  if (res) return httpd_resp_send_500(req);

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

// ══════════════════════════════════════════════════════════════════════════════
//  Register read handler  (/greg?reg=<r>&mask=<m>)
// ══════════════════════════════════════════════════════════════════════════════
static esp_err_t greg_handler(httpd_req_t *req) {
  char *buf = NULL;
  char  _reg[32], _mask[32];

  if (parse_get(req, &buf) != ESP_OK) return ESP_FAIL;
  if (httpd_query_key_value(buf, "reg",  _reg,  sizeof(_reg))  != ESP_OK
   || httpd_query_key_value(buf, "mask", _mask, sizeof(_mask)) != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

