sployal/surveilance_security/Esp32video_stream/app_httpd.cpp
  int reg = atoi(_reg), mask = atoi(_mask);
  sensor_t *s   = esp_camera_sensor_get();
  int       res = s->get_reg(s, reg, mask);
  if (res < 0) return httpd_resp_send_500(req);
  log_i("Get Register: reg: 0x%02x, mask: 0x%02x, value: 0x%02x",
        reg, mask, res);

  char        buffer[20];
  const char *val = itoa(res, buffer, 10);
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, val, strlen(val));
}

// ══════════════════════════════════════════════════════════════════════════════
//  PLL handler  (/pll?bypass=&mul=&sys=&root=&pre=&seld5=&pclken=&pclk=)
// ══════════════════════════════════════════════════════════════════════════════
static esp_err_t pll_handler(httpd_req_t *req) {
  char *buf = NULL;
  if (parse_get(req, &buf) != ESP_OK) return ESP_FAIL;

  int bypass = parse_get_var(buf, "bypass", 0);
  int mul    = parse_get_var(buf, "mul",    0);
  int sys    = parse_get_var(buf, "sys",    0);
  int root   = parse_get_var(buf, "root",   0);
  int pre    = parse_get_var(buf, "pre",    0);
  int seld5  = parse_get_var(buf, "seld5",  0);
  int pclken = parse_get_var(buf, "pclken", 0);
  int pclk   = parse_get_var(buf, "pclk",   0);
  free(buf);

  log_i("Set Pll: bypass:%d mul:%d sys:%d root:%d pre:%d seld5:%d pclken:%d pclk:%d",
        bypass, mul, sys, root, pre, seld5, pclken, pclk);
  sensor_t *s   = esp_camera_sensor_get();
  int       res = s->set_pll(s, bypass, mul, sys, root, pre, seld5, pclken, pclk);
  if (res) return httpd_resp_send_500(req);

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

// ══════════════════════════════════════════════════════════════════════════════
//  Window / resolution handler  (/resolution?sx=&sy=&ex=&ey=&...)
// ══════════════════════════════════════════════════════════════════════════════
static esp_err_t win_handler(httpd_req_t *req) {
  char *buf = NULL;
  if (parse_get(req, &buf) != ESP_OK) return ESP_FAIL;

  int startX  = parse_get_var(buf, "sx",      0);
  int startY  = parse_get_var(buf, "sy",      0);
  int endX    = parse_get_var(buf, "ex",      0);
  int endY    = parse_get_var(buf, "ey",      0);
  int offsetX = parse_get_var(buf, "offx",    0);
  int offsetY = parse_get_var(buf, "offy",    0);
  int totalX  = parse_get_var(buf, "tx",      0);
  int totalY  = parse_get_var(buf, "ty",      0); // codespell:ignore totaly
  int outputX = parse_get_var(buf, "ox",      0);
  int outputY = parse_get_var(buf, "oy",      0);
  bool scale   = parse_get_var(buf, "scale",   0) == 1;
  bool binning = parse_get_var(buf, "binning", 0) == 1;
  free(buf);

  log_i("Set Window: Start:%d %d End:%d %d Offset:%d %d Total:%d %d Output:%d %d Scale:%u Binning:%u",
        startX, startY, endX, endY, offsetX, offsetY,
        totalX, totalY, outputX, outputY, scale, binning); // codespell:ignore totaly
  sensor_t *s   = esp_camera_sensor_get();
  int       res = s->set_res_raw(s, startX, startY, endX, endY,
                                  offsetX, offsetY, totalX, totalY,
                                  outputX, outputY, scale, binning); // codespell:ignore totaly
  if (res) return httpd_resp_send_500(req);

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

// ══════════════════════════════════════════════════════════════════════════════
//  ★  SERVO HANDLER  (/servo?angle=<0-180>)                                ★
//
//  Called by the Python ServoTracker class.
//  myServo is declared in the .ino and extern'd at the top of this file.
//
//  Example:  GET http://192.168.43.8/servo?angle=90
// ══════════════════════════════════════════════════════════════════════════════
static esp_err_t servo_handler(httpd_req_t *req) {
  char *buf = NULL;
  if (parse_get(req, &buf) != ESP_OK) return ESP_FAIL;

  char angle_str[8] = {0};
  if (httpd_query_key_value(buf, "angle", angle_str, sizeof(angle_str)) != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  int angle = atoi(angle_str);

  // Safety clamp — never send the servo out of range
  if (angle < 0)   angle = 0;
  if (angle > 180) angle = 180;

  myServo.write(angle);
  log_i("Servo → %d°", angle);

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

// ══════════════════════════════════════════════════════════════════════════════
//  Index (root) handler
// ══════════════════════════════════════════════════════════════════════════════
static esp_err_t index_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
  sensor_t *s = esp_camera_sensor_get();
  if (s != NULL) {
    if      (s->id.PID == OV3660_PID)
      return httpd_resp_send(req, (const char *)index_ov3660_html_gz,
                                                index_ov3660_html_gz_len);
    else if (s->id.PID == OV5640_PID)
      return httpd_resp_send(req, (const char *)index_ov5640_html_gz,
                                                index_ov5640_html_gz_len);
    else
      return httpd_resp_send(req, (const char *)index_ov2640_html_gz,
                                                index_ov2640_html_gz_len);
  } else {
    log_e("Camera sensor not found");
    return httpd_resp_send_500(req);
  }
}

// ══════════════════════════════════════════════════════════════════════════════
//  startCameraServer()
// ══════════════════════════════════════════════════════════════════════════════

// Helper macro: fill an httpd_uri_t in one shot
#ifdef CONFIG_HTTPD_WS_SUPPORT
#define MAKE_URI(name_, uri_, method_, handler_)           \
  httpd_uri_t name_ = {                                    \
    .uri                     = uri_,                       \
    .method                  = method_,                    \
    .handler                 = handler_,                   \
    .user_ctx                = NULL,                       \
    .is_websocket            = true,                       \
    .handle_ws_control_frames = false,                     \
    .supported_subprotocol   = NULL                        \
  }
#else
#define MAKE_URI(name_, uri_, method_, handler_)           \
  httpd_uri_t name_ = {                                    \
    .uri      = uri_,                                      \
    .method   = method_,                                   \
    .handler  = handler_,                                  \
    .user_ctx = NULL                                       \
  }
#endif

