sployal/surveilance_security/Esp32video_stream/app_httpd.cpp
void startCameraServer() {
  httpd_config_t config    = HTTPD_DEFAULT_CONFIG();
  config.max_uri_handlers  = 16;  // enough for all handlers including /servo

  // ── URI definitions ──────────────────────────────────────────────────────
  MAKE_URI(index_uri,   "/",           HTTP_GET, index_handler);
  MAKE_URI(status_uri,  "/status",     HTTP_GET, status_handler);
  MAKE_URI(cmd_uri,     "/control",    HTTP_GET, cmd_handler);
  MAKE_URI(capture_uri, "/capture",    HTTP_GET, capture_handler);
  MAKE_URI(stream_uri,  "/stream",     HTTP_GET, stream_handler);
  MAKE_URI(bmp_uri,     "/bmp",        HTTP_GET, bmp_handler);
  MAKE_URI(xclk_uri,    "/xclk",       HTTP_GET, xclk_handler);
  MAKE_URI(reg_uri,     "/reg",        HTTP_GET, reg_handler);
  MAKE_URI(greg_uri,    "/greg",       HTTP_GET, greg_handler);
  MAKE_URI(pll_uri,     "/pll",        HTTP_GET, pll_handler);
  MAKE_URI(win_uri,     "/resolution", HTTP_GET, win_handler);
  MAKE_URI(servo_uri,   "/servo",      HTTP_GET, servo_handler); // ← NEW

  ra_filter_init(&ra_filter, 20);

  // ── Camera HTTP server (port 80) ─────────────────────────────────────────
  log_i("Starting web server on port: '%d'", config.server_port);
  if (httpd_start(&camera_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &bmp_uri);
    httpd_register_uri_handler(camera_httpd, &xclk_uri);
    httpd_register_uri_handler(camera_httpd, &reg_uri);
    httpd_register_uri_handler(camera_httpd, &greg_uri);
    httpd_register_uri_handler(camera_httpd, &pll_uri);
    httpd_register_uri_handler(camera_httpd, &win_uri);
    httpd_register_uri_handler(camera_httpd, &servo_uri);  // ← NEW
  }

  // ── Stream HTTP server (port 81) ─────────────────────────────────────────
  config.server_port += 1;
  config.ctrl_port   += 1;
  log_i("Starting stream server on port: '%d'", config.server_port);
  if (httpd_start(&stream_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(stream_httpd, &stream_uri);
  }
}

// ══════════════════════════════════════════════════════════════════════════════
//  setupLedFlash()
// ══════════════════════════════════════════════════════════════════════════════
void setupLedFlash() {
#if defined(LED_GPIO_NUM)
  ledcAttach(LED_GPIO_NUM, 5000, 8);
#else
  log_i("LED flash is disabled -> LED_GPIO_NUM undefined");
#endif
}